#ifndef _BSP_PALT_DATA_H_
#define _BSP_PALT_DATA_H_

/*
*********************************************************************************************************
*                                           BOARD VERSION
*********************************************************************************************************
*/
#define  ARMFLY_V5								1u    /* DEMO Board              */
#define  TK100_V1								2u    /* TK100+ CPU Board Ver1.0 */
#define  TK100_V2								3u    /* TK100+ CPU Board Ver2.0 */
#define  BOARD_VERSION		                    2u

/*
*********************************************************************************************************
*                                           RUN MODE
*********************************************************************************************************
*/
#define  RELEASE_MODE							1u
#define  DEBUG_MODE								2u
#define  RUN_MODE								2u


/*
*********************************************************************************************************
*                                           PRG VERSION//程序版本号定义
*********************************************************************************************************
*/
/**定义的版本号为:PRG_VER_BYTE4.PRG_VER_BYTE3.PRG_VER_BYTE2.PRG_VER_BYTE1,特此说明****/
#define PRG_VER_BYTE4							0u
#define PRG_VER_BYTE3							0u
#define PRG_VER_BYTE2							5u
#define PRG_VER_BYTE1							0u

#endif /* _BSP_PALT_DATA_H_ */
