/*
*********************************************************************************************************
*	                                  
*	模块名称 : 
*	文件名称 : MenuConfig.h
*	版    本 : V1.0
*	说    明 : 实现按键各种功能
*              
*	修改记录 :
*		版本号   日期         作者          说明
*		V1.0    2016-07-16   Eric2013  	    首版    
*                                     
*	Copyright (C), 2015-2020, 安富莱电子 www.armfly.com
*
*********************************************************************************************************
*/


#ifndef __Home_Config_H
#define __Home_Config_H

#include "User_GUI.h"









/*
************************************************************************
*						供外部文件调用
************************************************************************
*/


void Home_Create_memdev(void);
void Boot_Sceen_Create(void);
void Create_BackGround_Frame(void);
#endif
